content/programming/notes/ml/intro-to-machine-learning.org
#+startup: content indent

[[file:../../../index.org][Giovanni's Diary]] > [[file:../../../subjects.org][Subjects]] > [[file:../../programming.org][Programming]] > [[file:../notes.org][Notes]] >

* Introduciton to Machine Learning
#+INDEX: Giovanni's Diary!Programming!Notes!Intro to Machine Learning

This page contains notes from the course Introduction to Machine
Learning by Elisa Ricci held in the academic year 2024-2025 at the
University of Trento.

Big thanks to [[https://www.microsoft.com/en-us/research/publication/pattern-recognition-machine-learning/][Pattern Recognition and Machine Learning]] by Christopher
Bishop which guided me in my studies.

- [[file:01-basics.org][Machine learning basics]]
- [[file:02-knn.org][K-Nearest Neighbors]]
- [[file:03-linear-models.org][Linear Models]]
- [[file:04-beyond-binary-classification.org][Beyond binary classification]]
- [[file:05-decision-trees.org][Decision trees]]
- [[file:06-gradient-descent.org][Gradient descent]]
- [[file:07-support-vector-machines.org][Support Vector Machines]]
- [[file:08-regularization.org][Regularization]]
- [[file:09-unsupervised-learning.org][Unsupervised learning]]
- [[file:10-clustering.org][Clustering]]
- [[file:11-neural-networks.org][Neural Networks]]
- [[file:12-deep-generative-models.org][Deep Generative Models]]
- [[file:13-diffusion-models.org][Diffusion Models]]
- [[file:14-reinforcement-learning.org][Reinforcement Learning]]
  
-----

Travel: [[file:../notes.org][Notes]], [[file:../../../theindex.org][Index]]
