public/programming/notes/ml/intro-to-machine-learning.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../../../index.html">Giovanni's Diary</a> &gt; <a href="../../../subjects.html">Subjects</a> &gt; <a href="../../programming.html">Programming</a> &gt; <a href="../notes.html">Notes</a> &gt;
</p>

<div id="outline-container-org3d8bd9f" class="outline-2">
<h2 id="org3d8bd9f">Introduciton to Machine Learning</h2>
<div class="outline-text-2" id="text-org3d8bd9f">
<p>
This page contains notes from the course Introduction to Machine
Learning by Elisa Ricci held in the academic year 2024-2025 at the
University of Trento.
</p>

<p>
Big thanks to <a href="https://www.microsoft.com/en-us/research/publication/pattern-recognition-machine-learning/">Pattern Recognition and Machine Learning</a> by Christopher
Bishop which guided me in my studies.
</p>

<ul class="org-ul">
<li><a href="01-basics.html">Machine learning basics</a></li>
<li><a href="02-knn.html">K-Nearest Neighbors</a></li>
<li><a href="03-linear-models.html">Linear Models</a></li>
<li><a href="04-beyond-binary-classification.html">Beyond binary classification</a></li>
<li><a href="05-decision-trees.html">Decision trees</a></li>
<li><a href="06-gradient-descent.html">Gradient descent</a></li>
<li><a href="07-support-vector-machines.html">Support Vector Machines</a></li>
<li><a href="08-regularization.html">Regularization</a></li>
<li><a href="09-unsupervised-learning.html">Unsupervised learning</a></li>
<li><a href="10-clustering.html">Clustering</a></li>
<li><a href="11-neural-networks.html">Neural Networks</a></li>
<li><a href="12-deep-generative-models.html">Deep Generative Models</a></li>
<li><a href="13-diffusion-models.html">Diffusion Models</a></li>
<li><a href="14-reinforcement-learning.html">Reinforcement Learning</a></li>
</ul>

<hr />

<p>
Travel: <a href="../notes.html">Notes</a>, <a href="../../../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</body>
</html>
